[
  {
    "id": "resp_101",
    "How satisfied are you with our customer service?": "Had to wait 2 hours on hold and the agent was rude. Worst customer service ever!",
    "What do you think about our product quality?": "Product quality is terrible. Broke after just one week of use.",
    "How would you rate your overall experience with our company?": "Absolutely terrible experience. Will never use this company again.",
    "Do you find our pricing reasonable?": "Way too expensive for what you get. Overpriced compared to competitors.",
    "How easy was it to navigate our website?": "Website is broken and impossible to use. Worst design ever.",
    "Would you purchase from us again?": "Never again! Already warning friends to stay away.",
    "How was your delivery experience?": "Package was damaged during delivery and it took forever to resolve.",
    "What are your thoughts on our return policy?": "Return policy is terrible! Too many restrictions and complicated process.",
    "sentiment_score": 0.28
  },
  {
    "id": "resp_102",
    "How satisfied are you with our customer service?": "Excellent customer service! Staff was knowledgeable and went above and beyond.",
    "What do you think about our product quality?": "Outstanding quality! Product works flawlessly and looks great.",
    "How would you rate your overall experience with our company?": "Fantastic experience from start to finish. Highly recommend!",
    "Do you find our pricing reasonable?": "Great value for money. Quality justifies the price completely.",
    "How easy was it to navigate our website?": "Website is intuitive and well-designed. Shopping was a pleasure.",
    "Would you purchase from us again?": "Absolutely! Already planning my next order.",
    "How was your delivery experience?": "Super fast delivery and perfect packaging. Very impressed!",
    "What are your thoughts on our return policy?": "Generous return policy shows confidence in their products.",
    "sentiment_score": 0.82
  },
  {
    "id": "resp_103",
    "How satisfied are you with our customer service?": "Service was acceptable but nothing special. Got the help I needed eventually.",
    "What do you think about our product quality?": "Product quality meets basic expectations. No major complaints.",
    "How would you rate your overall experience with our company?": "It was an okay experience. Neither great nor terrible.",
    "Do you find our pricing reasonable?": "Pricing is fair and competitive with other similar companies.",
    "How easy was it to navigate our website?": "Website is functional but could use some user experience improvements.",
    "Would you purchase from us again?": "I might consider it depending on what alternatives are available.",
    "How was your delivery experience?": "Delivery was on time and package was intact. Standard service.",
    "What are your thoughts on our return policy?": "Return policy is standard for the industry. Nothing remarkable.",
    "sentiment_score": 0.50
  },
  {
    "id": "resp_104",
    "How satisfied are you with our customer service?": "Customer service exceeded expectations. Very professional and helpful staff.",
    "What do you think about our product quality?": "High-quality product that works exactly as advertised. Very satisfied.",
    "How would you rate your overall experience with our company?": "Great experience overall. Professional company with good products.",
    "Do you find our pricing reasonable?": "Fair pricing for the level of quality and service provided.",
    "How easy was it to navigate our website?": "Website is easy to use and well-organized. Found what I needed quickly.",
    "Would you purchase from us again?": "Yes, definitely considering future purchases from this company.",
    "How was your delivery experience?": "Prompt delivery and item arrived in excellent condition.",
    "What are your thoughts on our return policy?": "Return policy is customer-friendly and clearly explained.",
    "sentiment_score": 0.75
  }
] 